In [2]:
import pandas as pd

In [46]:
data = dict(names = ["ade", "jonah", "sule", "monica", "laide", "laide"], 
                           ages = [34,45,98,54,13, 15], 
                           hobbies = ["dancing", "dancing", "runing", "singing", "reading", "dancing"])


new_df = pd.DataFrame(data)
data

{'names': ['ade', 'jonah', 'sule', 'monica', 'laide', 'laide'],
 'ages': [34, 45, 98, 54, 13, 15],
 'hobbies': ['dancing', 'dancing', 'runing', 'singing', 'reading', 'dancing']}

In [4]:
new_df

    names  ages  hobbies
0     ade    34  dancing
1   jonah    45  dancing
2    sule    12   runing
3  monica    54  singing
4   laide    13  reading

In [10]:
new_df2 = pd.DataFrame()
type(new_df2)

pandas.core.frame.DataFrame

In [9]:
# PANDAS SERIES COULD BE A COLUMN SLICE OR A ROW PICKED BY INDEX
type(new_df["names"])

pandas.core.series.Series

In [14]:
new_df["weight"] = [54, 43, 23, 19, 36]
new_df["scores"] = [90, 60, 23, 19, 100]
# new_df2["ages"] = [34,45,12,54,13]

In [15]:
new_df

    names  ages  hobbies  weight  scores
0     ade    34  dancing      54      90
1   jonah    45  dancing      43      60
2    sule    12   runing      23      23
3  monica    54  singing      19      19
4   laide    13  reading      36     100

In [16]:
new_df.info() #TECHNICAL INFORMATION

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   names    5 non-null      object
 1   ages     5 non-null      int64
 2   hobbies  5 non-null      object
 3   weight   5 non-null      int64
 4   scores   5 non-null      int64
dtypes: int64(3), object(2)
memory usage: 328.0+ bytes

In [17]:
new_df.describe() # STATISTICAL INFO

            ages     weight      scores
count   5.000000   5.000000    5.000000
mean   31.600000  35.000000   58.400000
std    18.822858  14.370108   37.206182
min    12.000000  19.000000   19.000000
25%    13.000000  23.000000   23.000000
50%    34.000000  36.000000   60.000000
75%    45.000000  43.000000   90.000000
max    54.000000  54.000000  100.000000

In [24]:
new_df.describe(include = ["O"])

        names  hobbies
count       6        6
unique      5        4
top     laide  dancing
freq        2        3

In [18]:
new_df["ages"] # PULLING OUT COLUMNS FROM DATAFRAME

0    34
1    45
2    12
3    54
4    13
Name: ages, dtype: int64

In [28]:
new_df.iloc[2:4]

    names  ages  hobbies
2    sule    12   runing
3  monica    54  singing

In [29]:
new_df

    names  ages  hobbies
0     ade    34  dancing
1   jonah    45  dancing
2    sule    12   runing
3  monica    54  singing
4   laide    13  reading
5   laide    15  dancing

In [40]:
mask = new_df.hobbies == "dancing" # CREATE A BOOL MASK FOR YOUNGER THAN SPECIFIC AGE

In [41]:
new_df[mask]

   names  ages  hobbies
0    ade    34  dancing
1  jonah    45  dancing
5  laide    15  dancing

In [49]:
max_age = new_df.ages.max()
mask = new_df.ages == max_age 
new_df[mask]

  names  ages hobbies
2  sule    98  runing

In [32]:
new_df.names # COL INDEXING USING DOT NOTATION
new_df["names"] # COL INDEXING USING SQUARE BRACES AND QUOTED STRING NOTATION

0       ade
1     jonah
2      sule
3    monica
4     laide
5     laide
Name: names, dtype: object

In [21]:
new_df[["names", "ages", "scores"]]

    names  ages  scores
0     ade    34      90
1   jonah    45      60
2    sule    12      23
3  monica    54      19
4   laide    13     100

In [6]:
new_df2

     name  ages
0     ade    34
1   jonah    45
2    sule    12
3  monica    54
4   laide    13

In [23]:
covid_data = pd.read_csv("time_series_covid19.csv")
# covid_data

In [8]:
type(covid_data)

pandas.core.frame.DataFrame

In [9]:
type(covid_data["Country/Region"])

pandas.core.series.Series

In [16]:
new_series = pd.Series(["29/11/2013", "10/01/2012", "15/03/2019", "30/12/2017", "19/07/2017" ])

In [17]:
type(new_series)

pandas.core.series.Series

In [18]:
new_df["application_date"] = new_series

In [19]:
new_df

    names  ages  hobbies application_date
0     ade    34  dancing       29/11/2013
1   jonah    45  dancing       10/01/2012
2    sule    12   runing       15/03/2019
3  monica    54  singing       30/12/2017
4   laide    13  reading       19/07/2017

In [32]:
new_series2 = pd.Series(["09/12/2013", "10/02/2013", "16/04/2019", "27/02/2019", "27/10/2017" ])

In [62]:
read_df["approval_date"] = new_series2

In [34]:
new_df

    names  ages  hobbies application_date
0     ade    34  dancing       29/11/2013
1   jonah    45  dancing       10/01/2012
2    sule    12   runing       15/03/2019
3  monica    54  singing       30/12/2017
4   laide    13  reading       19/07/2017

In [35]:
new_df.to_csv("applicants.csv")

In [36]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
names               5 non-null object
ages                5 non-null int64
hobbies             5 non-null object
application_date    5 non-null object
dtypes: int64(1), object(3)
memory usage: 240.0+ bytes

In [37]:
# covid_data.info()

###### READ CSV WITH PANDAS

In [38]:
read_df = pd.read_csv("applicants.csv")
read_df

   Unnamed: 0   names  ages  hobbies application_date
0           0     ade    34  dancing       29/11/2013
1           1   jonah    45  dancing       10/01/2012
2           2    sule    12   runing       15/03/2019
3           3  monica    54  singing       30/12/2017
4           4   laide    13  reading       19/07/2017

In [39]:
read_df.info() #Technical overview

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
Unnamed: 0          5 non-null int64
names               5 non-null object
ages                5 non-null int64
hobbies             5 non-null object
application_date    5 non-null object
dtypes: int64(2), object(3)
memory usage: 280.0+ bytes

In [40]:
read_df.describe() #statiscal overview

       Unnamed: 0       ages
count    5.000000   5.000000
mean     2.000000  31.600000
std      1.581139  18.822858
min      0.000000  12.000000
25%      1.000000  13.000000
50%      2.000000  34.000000
75%      3.000000  45.000000
max      4.000000  54.000000

In [43]:
#drop column named unknown
read_df = read_df.drop(columns = ["Unnamed: 0"])
# read_df

    names  ages  hobbies application_date
0     ade    34  dancing       29/11/2013
1   jonah    45  dancing       10/01/2012
2    sule    12   runing       15/03/2019
3  monica    54  singing       30/12/2017
4   laide    13  reading       19/07/2017

In [44]:
read_df.describe()

            ages
count   5.000000
mean   31.600000
std    18.822858
min    12.000000
25%    13.000000
50%    34.000000
75%    45.000000
max    54.000000

In [45]:
read_df.describe(include = ['O'])

       names  hobbies application_date
count      5        5                5
unique     5        4                5
top      ade  dancing       10/01/2012
freq       1        2                1

In [46]:
read_df.ages.max()

54

In [47]:
read_df.ages.min()

12

In [48]:
read_df.ages==13

0    False
1    False
2    False
3    False
4     True
Name: ages, dtype: bool

In [49]:
read_df[read_df.ages==13].names

4    laide
Name: names, dtype: object

In [50]:
read_df[read_df.ages==54]

    names  ages  hobbies application_date
3  monica    54  singing       30/12/2017

In [51]:
max_age = read_df.ages.max()
read_df[read_df.ages==max_age]

    names  ages  hobbies application_date
3  monica    54  singing       30/12/2017

In [52]:
read_df.plot("names", "ages", kind = "bar", color = ["red", "blue", "green", "yellow", "orange"])

In [53]:
sales_data = pd.read_csv("sales.csv")

In [54]:
sales_data.head()

   index  monday  tuesday  wednesday  thursday  friday  saturday  sunday
0      0     923      631        935       371     756      3166     114
1      1     918      626        930       366     751      3161     109
2      2     497      305        403       239     434       824      67
3      3     499      307        405       241     436       826      69
4      4     501      309        407       243     438       828      71

In [55]:
sales_data.tail()

     index  monday  tuesday  wednesday  thursday  friday  saturday  sunday
100    100     855      428        630       254     511      2318     203
101    101    1283      641        945       381     766      3476     304
102    102    1183      641        945       381     766      3426     274
103    103    1133      641        945       381     766      3376     244
104    104    1133      641        945       381     766      3376     244

In [56]:
sales_data = sales_data.drop(columns = ["index"])

In [57]:
# sales_data

In [58]:
sales_data.describe()

,monday,tuesday,wednesday,thursday,friday,saturday,sunday
count,105.000000,105.000000,105.000000,105.000000,105.000000,105.000000,105.000000
mean,597.866667,365.400000,512.400000,251.276190,397.695238,1435.504762,96.276190
std,214.858275,126.716112,212.547081,70.409174,160.208585,816.576756,58.349329
min,380.000000,190.000000,280.000000,113.000000,120.000000,824.000000,30.000000
25%,500.000000,305.000000,403.000000,200.000000,287.000000,852.000000,73.000000
50%,521.000000,329.000000,425.000000,253.000000,397.000000,1130.000000,90.000000
75%,570.000000,360.000000,450.000000,283.000000,450.000000,1200.000000,90.000000
max,1283.000000,641.000000,945.000000,381.000000,766.000000,3476.000000,304.000000

In [69]:
read_df

    names  ages  hobbies application_date approval_date date_difference
0     ade    34  dancing       2013-11-29    2013-09-12         78 days
1   jonah    45  dancing       2012-10-01    2013-10-02       -366 days
2    sule    12   runing       2019-03-15    2019-04-16        -32 days
3  monica    54  singing       2017-12-30    2019-02-27       -424 days
4   laide    13  reading       2017-07-19    2017-10-27       -100 days

In [60]:
# read_df.application_date - read_df.approval_date # THROWS AN ERROR OF OPERATION

In [63]:
application_date_as_datetime = pd.to_datetime(read_df.application_date)
approval_date_as_datetime = pd.to_datetime(read_df.approval_date)

In [64]:
read_df.application_date = application_date_as_datetime
read_df.approval_date = approval_date_as_datetime

In [68]:
read_df.application_date - read_df.approval_date # THROWS AN ERROR OF OPERATION

In [70]:
read_df["date_difference"] = read_df.application_date - read_df.approval_date

In [ ]:
import pandas as pd
data = pd.read_csv('nyc_weather.csv')

In [ ]:
max_temp = data.Temperature.max()

In [ ]:
data[data.Temperature == max_temp]
df = data.copy()

In [ ]:
data.info()

In [ ]:
data

In [39]:
data.describe(include = "O")

              EST PrecipitationIn Events
count          31              31      9
unique         31               7      3
top     1/24/2016               0   Rain
freq            1              19      4

In [40]:
df['EST'][df['Events']=='Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [41]:
df.Events.fillna(0, inplace=True)
df['WindSpeedMPH'].mean()

6.892857142857143

In [42]:
df

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,0,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,0,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,0,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,0,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,0,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,0,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,0,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,0,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
10,1/11/2016,33,8,37,29.92,10,NaN,0,1,0,289
11,1/12/2016,35,15,53,29.85,10,6.0,T,4,0,235
12,1/13/2016,26,4,42,29.94,10,10.0,0,0,0,284
13,1/14/2016,30,12,47,29.95,10,5.0,T,7,0,266
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,0,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
16,1/17/2016,36,23,66,29.78,8,6.0,0.05,6,Fog-Snow,345
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293
18,1/19/2016,22,3,42,30.03,10,11.0,0,1,0,293
19,1/20/2016,32,15,49,30.13,10,6.0,0,2,0,302
20,1/21/2016,31,11,45,30.15,10,6.0,0,1,0,312
21,1/22/2016,26,6,41,30.21,9,NaN,0.01,3,Snow,34
22,1/23/2016,26,21,78,29.77,1,16.0,2.31,8,Fog-Snow,42
23,1/24/2016,28,11,53,29.92,8,6.0,T,3,Snow,327
24,1/25/2016,34,18,54,30.25,10,3.0,0,2,0,286
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,0,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,0,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,0,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,0,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,0,241

In [49]:
my_data = [{"name":"Attah","age":20}, {"name":"Bolu","age":30}]

In [50]:
pd.DataFrame(my_data)

   age   name
0   20  Attah
1   30   Bolu

In [55]:
df.iloc[10]

EST                     1/11/2016
Temperature                    33
DewPoint                        8
Humidity                       37
Sea Level PressureIn        29.92
VisibilityMiles                10
WindSpeedMPH                  NaN
PrecipitationIn                 0
CloudCover                      1
Events                          0
WindDirDegrees                289
Name: 10, dtype: object